---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinePattern
source: html/88ceb32e-e477-c17a-0eae-6a5262269f2b.htm
---
# LinePattern Methods

Gets the sequence of segments that defines this line pattern.